set_wire_load_mode segmented
create_clock -name {clk} -period 7.000000 -waveform { 0.000000 5.000000 } [get_ports {clk}]
set_clock_transition 0.200000 [get_clocks {clk}]
set_clock_latency 0.300000 [get_clocks {clk}]
set_clock_uncertainty 0.500000 [get_clocks {clk}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {rst_b}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {en}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {start}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[31]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[30]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[29]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[28]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[27]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[26]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[25]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[24]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[23]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[22]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[21]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[20]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[19]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[18]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[17]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[16]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[15]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[14]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[13]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[12]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[11]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[10]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[9]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[8]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[7]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[6]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[5]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[4]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[3]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[2]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[1]}]
set_input_delay -max 4.000000 -clock {clk} [get_ports {feature_in[0]}]
set_output_delay -max 4.000000 -clock {clk} [get_ports {done}]
set_output_delay -max 4.000000 -clock {clk} [get_ports {result_byte[7]}]
set_output_delay -max 4.000000 -clock {clk} [get_ports {result_byte[6]}]
set_output_delay -max 4.000000 -clock {clk} [get_ports {result_byte[5]}]
set_output_delay -max 4.000000 -clock {clk} [get_ports {result_byte[4]}]
set_output_delay -max 4.000000 -clock {clk} [get_ports {result_byte[3]}]
set_output_delay -max 4.000000 -clock {clk} [get_ports {result_byte[2]}]
set_output_delay -max 4.000000 -clock {clk} [get_ports {result_byte[1]}]
set_output_delay -max 4.000000 -clock {clk} [get_ports {result_byte[0]}]
set_max_transition 3.000000 [current_design]
set_max_transition 100.000000 [get_ports {feature_in[29]}]
set_max_capacitance 80.000000 [get_ports {feature_in[29]}]
set_max_transition 100.000000 [get_ports {feature_in[29]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[29]}]
set_load -pin_load 4.370000 [get_ports {result_byte[1]}]
set_max_transition 100.000000 [get_ports {feature_in[22]}]
set_max_capacitance 80.000000 [get_ports {feature_in[22]}]
set_max_transition 100.000000 [get_ports {feature_in[22]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[22]}]
set_max_transition 100.000000 [get_ports {feature_in[31]}]
set_max_capacitance 80.000000 [get_ports {feature_in[31]}]
set_max_transition 100.000000 [get_ports {feature_in[31]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[31]}]
set_max_transition 100.000000 [get_ports {feature_in[23]}]
set_max_capacitance 80.000000 [get_ports {feature_in[23]}]
set_max_transition 100.000000 [get_ports {feature_in[23]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[23]}]
set_max_transition 100.000000 [get_ports {feature_in[2]}]
set_max_capacitance 80.000000 [get_ports {feature_in[2]}]
set_max_transition 100.000000 [get_ports {feature_in[2]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[2]}]
set_max_transition 100.000000 [get_ports {rst_b}]
set_max_capacitance 80.000000 [get_ports {rst_b}]
set_max_transition 100.000000 [get_ports {rst_b}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {rst_b}]
set_max_transition 100.000000 [get_ports {feature_in[3]}]
set_max_capacitance 80.000000 [get_ports {feature_in[3]}]
set_max_transition 100.000000 [get_ports {feature_in[3]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[3]}]
set_max_transition 100.000000 [get_ports {clk}]
set_max_capacitance 80.000000 [get_ports {clk}]
set_max_transition 100.000000 [get_ports {clk}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {clk}]
set_load -pin_load 4.370000 [get_ports {result_byte[2]}]
set_max_transition 100.000000 [get_ports {feature_in[13]}]
set_max_capacitance 80.000000 [get_ports {feature_in[13]}]
set_max_transition 100.000000 [get_ports {feature_in[13]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[13]}]
set_max_transition 100.000000 [get_ports {feature_in[4]}]
set_max_capacitance 80.000000 [get_ports {feature_in[4]}]
set_max_transition 100.000000 [get_ports {feature_in[4]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[4]}]
set_load -pin_load 4.370000 [get_ports {done}]
set_load -pin_load 4.370000 [get_ports {result_byte[7]}]
set_max_transition 100.000000 [get_ports {feature_in[5]}]
set_max_capacitance 80.000000 [get_ports {feature_in[5]}]
set_max_transition 100.000000 [get_ports {feature_in[5]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[5]}]
set_max_transition 100.000000 [get_ports {feature_in[14]}]
set_max_capacitance 80.000000 [get_ports {feature_in[14]}]
set_max_transition 100.000000 [get_ports {feature_in[14]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[14]}]
set_max_transition 100.000000 [get_ports {feature_in[24]}]
set_max_capacitance 80.000000 [get_ports {feature_in[24]}]
set_max_transition 100.000000 [get_ports {feature_in[24]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[24]}]
set_max_transition 100.000000 [get_ports {feature_in[6]}]
set_max_capacitance 80.000000 [get_ports {feature_in[6]}]
set_max_transition 100.000000 [get_ports {feature_in[6]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[6]}]
set_max_transition 100.000000 [get_ports {feature_in[15]}]
set_max_capacitance 80.000000 [get_ports {feature_in[15]}]
set_max_transition 100.000000 [get_ports {feature_in[15]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[15]}]
set_load -pin_load 4.370000 [get_ports {result_byte[3]}]
set_max_transition 100.000000 [get_ports {feature_in[25]}]
set_max_capacitance 80.000000 [get_ports {feature_in[25]}]
set_max_transition 100.000000 [get_ports {feature_in[25]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[25]}]
set_max_transition 100.000000 [get_ports {feature_in[16]}]
set_max_capacitance 80.000000 [get_ports {feature_in[16]}]
set_max_transition 100.000000 [get_ports {feature_in[16]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[16]}]
set_max_transition 100.000000 [get_ports {feature_in[17]}]
set_max_capacitance 80.000000 [get_ports {feature_in[17]}]
set_max_transition 100.000000 [get_ports {feature_in[17]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[17]}]
set_max_transition 100.000000 [get_ports {feature_in[30]}]
set_max_capacitance 80.000000 [get_ports {feature_in[30]}]
set_max_transition 100.000000 [get_ports {feature_in[30]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[30]}]
set_max_transition 100.000000 [get_ports {feature_in[28]}]
set_max_capacitance 80.000000 [get_ports {feature_in[28]}]
set_max_transition 100.000000 [get_ports {feature_in[28]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[28]}]
set_max_transition 100.000000 [get_ports {feature_in[27]}]
set_max_capacitance 80.000000 [get_ports {feature_in[27]}]
set_max_transition 100.000000 [get_ports {feature_in[27]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[27]}]
set_load -pin_load 4.370000 [get_ports {result_byte[6]}]
set_max_transition 100.000000 [get_ports {feature_in[7]}]
set_max_capacitance 80.000000 [get_ports {feature_in[7]}]
set_max_transition 100.000000 [get_ports {feature_in[7]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[7]}]
set_max_transition 100.000000 [get_ports {feature_in[26]}]
set_max_capacitance 80.000000 [get_ports {feature_in[26]}]
set_max_transition 100.000000 [get_ports {feature_in[26]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[26]}]
set_load -pin_load 4.370000 [get_ports {result_byte[4]}]
set_max_transition 100.000000 [get_ports {feature_in[8]}]
set_max_capacitance 80.000000 [get_ports {feature_in[8]}]
set_max_transition 100.000000 [get_ports {feature_in[8]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[8]}]
set_max_transition 100.000000 [get_ports {feature_in[0]}]
set_max_capacitance 80.000000 [get_ports {feature_in[0]}]
set_max_transition 100.000000 [get_ports {feature_in[0]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[0]}]
set_max_transition 100.000000 [get_ports {feature_in[9]}]
set_max_capacitance 80.000000 [get_ports {feature_in[9]}]
set_max_transition 100.000000 [get_ports {feature_in[9]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[9]}]
set_max_transition 100.000000 [get_ports {feature_in[18]}]
set_max_capacitance 80.000000 [get_ports {feature_in[18]}]
set_max_transition 100.000000 [get_ports {feature_in[18]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[18]}]
set_load -pin_load 4.370000 [get_ports {result_byte[0]}]
set_max_transition 100.000000 [get_ports {en}]
set_max_capacitance 80.000000 [get_ports {en}]
set_max_transition 100.000000 [get_ports {en}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {en}]
set_max_transition 100.000000 [get_ports {feature_in[19]}]
set_max_capacitance 80.000000 [get_ports {feature_in[19]}]
set_max_transition 100.000000 [get_ports {feature_in[19]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[19]}]
set_max_transition 100.000000 [get_ports {feature_in[1]}]
set_max_capacitance 80.000000 [get_ports {feature_in[1]}]
set_max_transition 100.000000 [get_ports {feature_in[1]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[1]}]
set_max_transition 100.000000 [get_ports {feature_in[10]}]
set_max_capacitance 80.000000 [get_ports {feature_in[10]}]
set_max_transition 100.000000 [get_ports {feature_in[10]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[10]}]
set_load -pin_load 4.370000 [get_ports {result_byte[5]}]
set_max_transition 100.000000 [get_ports {feature_in[11]}]
set_max_capacitance 80.000000 [get_ports {feature_in[11]}]
set_max_transition 100.000000 [get_ports {feature_in[11]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[11]}]
set_max_transition 100.000000 [get_ports {feature_in[20]}]
set_max_capacitance 80.000000 [get_ports {feature_in[20]}]
set_max_transition 100.000000 [get_ports {feature_in[20]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[20]}]
set_ideal_network [get_ports {rst_b}]
set_max_transition 100.000000 [get_ports {feature_in[12]}]
set_max_capacitance 80.000000 [get_ports {feature_in[12]}]
set_max_transition 100.000000 [get_ports {feature_in[12]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[12]}]
set_max_transition 100.000000 [get_ports {start}]
set_max_capacitance 80.000000 [get_ports {start}]
set_max_transition 100.000000 [get_ports {start}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {start}]
set_max_transition 100.000000 [get_ports {feature_in[21]}]
set_max_capacitance 80.000000 [get_ports {feature_in[21]}]
set_max_transition 100.000000 [get_ports {feature_in[21]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {feature_in[21]}]
