set_wire_load_mode segmented
create_clock -name {clk} -period 7.000000 -waveform { 0.000000 3.500000 } [get_ports {clk}]
set_clock_transition 0.200000 [get_clocks {clk}]
set_clock_latency 0.300000 [get_clocks {clk}]
set_clock_latency -source 4.000000 [get_clocks {clk}]
set_clock_uncertainty 0.500000 [get_clocks {clk}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {enable}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {rst_n}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[55]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[54]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[53]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[52]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[51]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[50]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[49]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[48]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[47]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[46]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[45]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[44]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[43]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[42]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[41]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[40]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[39]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[38]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[37]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[36]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[35]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[34]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[33]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[32]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[31]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[30]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[29]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[28]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[27]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[26]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[25]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[24]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[23]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[22]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[21]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[20]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[19]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[18]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[17]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[16]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[15]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[14]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[13]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[12]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[11]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[10]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[9]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[8]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[7]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[6]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[5]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[4]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[3]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[2]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[1]}]
set_input_delay -max 5.000000 -clock {clk} [get_ports {data_in[0]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {enable_out}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[63]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[62]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[61]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[60]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[59]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[58]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[57]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[56]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[55]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[54]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[53]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[52]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[51]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[50]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[49]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[48]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[47]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[46]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[45]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[44]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[43]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[42]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[41]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[40]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[39]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[38]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[37]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[36]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[35]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[34]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[33]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[32]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[31]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[30]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[29]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[28]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[27]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[26]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[25]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[24]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[23]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[22]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[21]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[20]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[19]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[18]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[17]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[16]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[15]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[14]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[13]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[12]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[11]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[10]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[9]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[8]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[7]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[6]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[5]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[4]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[3]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[2]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[1]}]
set_output_delay -max 5.000000 -clock {clk} [get_ports {data_out[0]}]
set_max_transition 3.000000 [current_design]
set_load -pin_load 4.370000 [get_ports {data_out[57]}]
set_load -pin_load 4.370000 [get_ports {data_out[5]}]
set_max_transition 100.000000 [get_ports {data_in[33]}]
set_max_capacitance 80.000000 [get_ports {data_in[33]}]
set_max_transition 100.000000 [get_ports {data_in[33]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[33]}]
set_load -pin_load 4.370000 [get_ports {data_out[32]}]
set_load -pin_load 4.370000 [get_ports {data_out[56]}]
set_load -pin_load 4.370000 [get_ports {data_out[31]}]
set_load -pin_load 4.370000 [get_ports {data_out[55]}]
set_max_transition 100.000000 [get_ports {data_in[25]}]
set_max_capacitance 80.000000 [get_ports {data_in[25]}]
set_max_transition 100.000000 [get_ports {data_in[25]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[25]}]
set_load -pin_load 4.370000 [get_ports {data_out[30]}]
set_load -pin_load 4.370000 [get_ports {data_out[54]}]
set_max_transition 100.000000 [get_ports {data_in[52]}]
set_max_capacitance 80.000000 [get_ports {data_in[52]}]
set_max_transition 100.000000 [get_ports {data_in[52]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[52]}]
set_max_transition 100.000000 [get_ports {data_in[55]}]
set_max_capacitance 80.000000 [get_ports {data_in[55]}]
set_max_transition 100.000000 [get_ports {data_in[55]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[55]}]
set_max_transition 100.000000 [get_ports {data_in[27]}]
set_max_capacitance 80.000000 [get_ports {data_in[27]}]
set_max_transition 100.000000 [get_ports {data_in[27]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[27]}]
set_load -pin_load 4.370000 [get_ports {data_out[29]}]
set_max_transition 100.000000 [get_ports {data_in[21]}]
set_max_capacitance 80.000000 [get_ports {data_in[21]}]
set_max_transition 100.000000 [get_ports {data_in[21]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[21]}]
set_load -pin_load 4.370000 [get_ports {data_out[53]}]
set_load -pin_load 4.370000 [get_ports {data_out[28]}]
set_load -pin_load 4.370000 [get_ports {data_out[52]}]
set_max_transition 100.000000 [get_ports {data_in[36]}]
set_max_capacitance 80.000000 [get_ports {data_in[36]}]
set_max_transition 100.000000 [get_ports {data_in[36]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[36]}]
set_max_transition 100.000000 [get_ports {data_in[30]}]
set_max_capacitance 80.000000 [get_ports {data_in[30]}]
set_max_transition 100.000000 [get_ports {data_in[30]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[30]}]
set_max_transition 100.000000 [get_ports {data_in[53]}]
set_max_capacitance 80.000000 [get_ports {data_in[53]}]
set_max_transition 100.000000 [get_ports {data_in[53]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[53]}]
set_load -pin_load 4.370000 [get_ports {data_out[27]}]
set_load -pin_load 4.370000 [get_ports {data_out[51]}]
set_load -pin_load 4.370000 [get_ports {data_out[26]}]
set_load -pin_load 4.370000 [get_ports {data_out[50]}]
set_max_transition 100.000000 [get_ports {data_in[54]}]
set_max_capacitance 80.000000 [get_ports {data_in[54]}]
set_max_transition 100.000000 [get_ports {data_in[54]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[54]}]
set_load -pin_load 4.370000 [get_ports {data_out[25]}]
set_max_transition 100.000000 [get_ports {data_in[11]}]
set_max_capacitance 80.000000 [get_ports {data_in[11]}]
set_max_transition 100.000000 [get_ports {data_in[11]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[11]}]
set_load -pin_load 4.370000 [get_ports {data_out[49]}]
set_max_transition 100.000000 [get_ports {data_in[48]}]
set_max_capacitance 80.000000 [get_ports {data_in[48]}]
set_max_transition 100.000000 [get_ports {data_in[48]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[48]}]
set_max_transition 100.000000 [get_ports {data_in[45]}]
set_max_capacitance 80.000000 [get_ports {data_in[45]}]
set_max_transition 100.000000 [get_ports {data_in[45]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[45]}]
set_max_transition 100.000000 [get_ports {data_in[41]}]
set_max_capacitance 80.000000 [get_ports {data_in[41]}]
set_max_transition 100.000000 [get_ports {data_in[41]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[41]}]
set_max_transition 100.000000 [get_ports {data_in[39]}]
set_max_capacitance 80.000000 [get_ports {data_in[39]}]
set_max_transition 100.000000 [get_ports {data_in[39]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[39]}]
set_load -pin_load 4.370000 [get_ports {data_out[24]}]
set_max_transition 100.000000 [get_ports {data_in[9]}]
set_max_capacitance 80.000000 [get_ports {data_in[9]}]
set_max_transition 100.000000 [get_ports {data_in[9]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[9]}]
set_max_transition 100.000000 [get_ports {clk}]
set_max_capacitance 80.000000 [get_ports {clk}]
set_max_transition 100.000000 [get_ports {clk}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {clk}]
set_max_transition 100.000000 [get_ports {data_in[6]}]
set_max_capacitance 80.000000 [get_ports {data_in[6]}]
set_max_transition 100.000000 [get_ports {data_in[6]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[6]}]
set_load -pin_load 4.370000 [get_ports {data_out[48]}]
set_load -pin_load 4.370000 [get_ports {data_out[23]}]
set_load -pin_load 4.370000 [get_ports {data_out[47]}]
set_load -pin_load 4.370000 [get_ports {data_out[22]}]
set_max_transition 100.000000 [get_ports {data_in[43]}]
set_max_capacitance 80.000000 [get_ports {data_in[43]}]
set_max_transition 100.000000 [get_ports {data_in[43]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[43]}]
set_load -pin_load 4.370000 [get_ports {data_out[21]}]
set_max_transition 100.000000 [get_ports {rst_n}]
set_max_capacitance 80.000000 [get_ports {rst_n}]
set_max_transition 100.000000 [get_ports {rst_n}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {rst_n}]
set_max_transition 100.000000 [get_ports {data_in[19]}]
set_max_capacitance 80.000000 [get_ports {data_in[19]}]
set_max_transition 100.000000 [get_ports {data_in[19]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[19]}]
set_max_transition 100.000000 [get_ports {enable}]
set_max_capacitance 80.000000 [get_ports {enable}]
set_max_transition 100.000000 [get_ports {enable}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {enable}]
set_max_transition 100.000000 [get_ports {data_in[35]}]
set_max_capacitance 80.000000 [get_ports {data_in[35]}]
set_max_transition 100.000000 [get_ports {data_in[35]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[35]}]
set_load -pin_load 4.370000 [get_ports {data_out[20]}]
set_load -pin_load 4.370000 [get_ports {data_out[19]}]
set_max_transition 100.000000 [get_ports {data_in[10]}]
set_max_capacitance 80.000000 [get_ports {data_in[10]}]
set_max_transition 100.000000 [get_ports {data_in[10]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[10]}]
set_max_transition 100.000000 [get_ports {data_in[22]}]
set_max_capacitance 80.000000 [get_ports {data_in[22]}]
set_max_transition 100.000000 [get_ports {data_in[22]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[22]}]
set_max_transition 100.000000 [get_ports {data_in[5]}]
set_max_capacitance 80.000000 [get_ports {data_in[5]}]
set_max_transition 100.000000 [get_ports {data_in[5]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[5]}]
set_load -pin_load 4.370000 [get_ports {data_out[18]}]
set_max_transition 100.000000 [get_ports {data_in[20]}]
set_max_capacitance 80.000000 [get_ports {data_in[20]}]
set_max_transition 100.000000 [get_ports {data_in[20]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[20]}]
set_max_transition 100.000000 [get_ports {data_in[0]}]
set_max_capacitance 80.000000 [get_ports {data_in[0]}]
set_max_transition 100.000000 [get_ports {data_in[0]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[0]}]
set_max_transition 100.000000 [get_ports {data_in[26]}]
set_max_capacitance 80.000000 [get_ports {data_in[26]}]
set_max_transition 100.000000 [get_ports {data_in[26]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[26]}]
set_load -pin_load 4.370000 [get_ports {data_out[17]}]
set_load -pin_load 4.370000 [get_ports {data_out[16]}]
set_max_transition 100.000000 [get_ports {data_in[12]}]
set_max_capacitance 80.000000 [get_ports {data_in[12]}]
set_max_transition 100.000000 [get_ports {data_in[12]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[12]}]
set_load -pin_load 4.370000 [get_ports {data_out[15]}]
set_load -pin_load 4.370000 [get_ports {data_out[62]}]
set_load -pin_load 4.370000 [get_ports {data_out[14]}]
set_max_transition 100.000000 [get_ports {data_in[40]}]
set_max_capacitance 80.000000 [get_ports {data_in[40]}]
set_max_transition 100.000000 [get_ports {data_in[40]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[40]}]
set_max_transition 100.000000 [get_ports {data_in[4]}]
set_max_capacitance 80.000000 [get_ports {data_in[4]}]
set_max_transition 100.000000 [get_ports {data_in[4]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[4]}]
set_load -pin_load 4.370000 [get_ports {data_out[13]}]
set_load -pin_load 4.370000 [get_ports {data_out[12]}]
set_load -pin_load 4.370000 [get_ports {data_out[63]}]
set_load -pin_load 4.370000 [get_ports {data_out[11]}]
set_load -pin_load 4.370000 [get_ports {data_out[10]}]
set_load -pin_load 4.370000 [get_ports {data_out[46]}]
set_load -pin_load 4.370000 [get_ports {data_out[9]}]
set_max_transition 100.000000 [get_ports {data_in[46]}]
set_max_capacitance 80.000000 [get_ports {data_in[46]}]
set_max_transition 100.000000 [get_ports {data_in[46]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[46]}]
set_max_transition 100.000000 [get_ports {data_in[8]}]
set_max_capacitance 80.000000 [get_ports {data_in[8]}]
set_max_transition 100.000000 [get_ports {data_in[8]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[8]}]
set_max_transition 100.000000 [get_ports {data_in[32]}]
set_max_capacitance 80.000000 [get_ports {data_in[32]}]
set_max_transition 100.000000 [get_ports {data_in[32]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[32]}]
set_load -pin_load 4.370000 [get_ports {data_out[45]}]
set_max_transition 100.000000 [get_ports {data_in[3]}]
set_max_capacitance 80.000000 [get_ports {data_in[3]}]
set_max_transition 100.000000 [get_ports {data_in[3]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[3]}]
set_load -pin_load 4.370000 [get_ports {data_out[8]}]
set_max_transition 100.000000 [get_ports {data_in[28]}]
set_max_capacitance 80.000000 [get_ports {data_in[28]}]
set_max_transition 100.000000 [get_ports {data_in[28]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[28]}]
set_max_transition 100.000000 [get_ports {data_in[15]}]
set_max_capacitance 80.000000 [get_ports {data_in[15]}]
set_max_transition 100.000000 [get_ports {data_in[15]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[15]}]
set_max_transition 100.000000 [get_ports {data_in[18]}]
set_max_capacitance 80.000000 [get_ports {data_in[18]}]
set_max_transition 100.000000 [get_ports {data_in[18]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[18]}]
set_max_transition 100.000000 [get_ports {data_in[24]}]
set_max_capacitance 80.000000 [get_ports {data_in[24]}]
set_max_transition 100.000000 [get_ports {data_in[24]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[24]}]
set_load -pin_load 4.370000 [get_ports {data_out[44]}]
set_load -pin_load 4.370000 [get_ports {data_out[7]}]
set_max_transition 100.000000 [get_ports {data_in[31]}]
set_max_capacitance 80.000000 [get_ports {data_in[31]}]
set_max_transition 100.000000 [get_ports {data_in[31]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[31]}]
set_max_transition 100.000000 [get_ports {data_in[49]}]
set_max_capacitance 80.000000 [get_ports {data_in[49]}]
set_max_transition 100.000000 [get_ports {data_in[49]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[49]}]
set_load -pin_load 4.370000 [get_ports {data_out[43]}]
set_load -pin_load 4.370000 [get_ports {data_out[6]}]
set_max_transition 100.000000 [get_ports {data_in[44]}]
set_max_capacitance 80.000000 [get_ports {data_in[44]}]
set_max_transition 100.000000 [get_ports {data_in[44]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[44]}]
set_load -pin_load 4.370000 [get_ports {data_out[42]}]
set_max_transition 100.000000 [get_ports {data_in[38]}]
set_max_capacitance 80.000000 [get_ports {data_in[38]}]
set_max_transition 100.000000 [get_ports {data_in[38]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[38]}]
set_max_transition 100.000000 [get_ports {data_in[47]}]
set_max_capacitance 80.000000 [get_ports {data_in[47]}]
set_max_transition 100.000000 [get_ports {data_in[47]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[47]}]
set_load -pin_load 4.370000 [get_ports {data_out[41]}]
set_max_transition 100.000000 [get_ports {data_in[7]}]
set_max_capacitance 80.000000 [get_ports {data_in[7]}]
set_max_transition 100.000000 [get_ports {data_in[7]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[7]}]
set_ideal_network [get_ports {rst_n}]
set_load -pin_load 4.370000 [get_ports {data_out[40]}]
set_max_transition 100.000000 [get_ports {data_in[42]}]
set_max_capacitance 80.000000 [get_ports {data_in[42]}]
set_max_transition 100.000000 [get_ports {data_in[42]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[42]}]
set_max_transition 100.000000 [get_ports {data_in[2]}]
set_max_capacitance 80.000000 [get_ports {data_in[2]}]
set_max_transition 100.000000 [get_ports {data_in[2]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[2]}]
set_load -pin_load 4.370000 [get_ports {data_out[4]}]
set_max_transition 100.000000 [get_ports {data_in[50]}]
set_max_capacitance 80.000000 [get_ports {data_in[50]}]
set_max_transition 100.000000 [get_ports {data_in[50]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[50]}]
set_load -pin_load 4.370000 [get_ports {data_out[39]}]
set_load -pin_load 4.370000 [get_ports {data_out[3]}]
set_load -pin_load 4.370000 [get_ports {data_out[0]}]
set_max_transition 100.000000 [get_ports {data_in[23]}]
set_max_capacitance 80.000000 [get_ports {data_in[23]}]
set_max_transition 100.000000 [get_ports {data_in[23]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[23]}]
set_load -pin_load 4.370000 [get_ports {data_out[38]}]
set_load -pin_load 4.370000 [get_ports {enable_out}]
set_max_transition 100.000000 [get_ports {data_in[13]}]
set_max_capacitance 80.000000 [get_ports {data_in[13]}]
set_max_transition 100.000000 [get_ports {data_in[13]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[13]}]
set_load -pin_load 4.370000 [get_ports {data_out[2]}]
set_load -pin_load 4.370000 [get_ports {data_out[1]}]
set_load -pin_load 4.370000 [get_ports {data_out[37]}]
set_max_transition 100.000000 [get_ports {data_in[37]}]
set_max_capacitance 80.000000 [get_ports {data_in[37]}]
set_max_transition 100.000000 [get_ports {data_in[37]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[37]}]
set_load -pin_load 4.370000 [get_ports {data_out[61]}]
set_load -pin_load 4.370000 [get_ports {data_out[36]}]
set_load -pin_load 4.370000 [get_ports {data_out[60]}]
set_max_transition 100.000000 [get_ports {data_in[29]}]
set_max_capacitance 80.000000 [get_ports {data_in[29]}]
set_max_transition 100.000000 [get_ports {data_in[29]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[29]}]
set_load -pin_load 4.370000 [get_ports {data_out[35]}]
set_max_transition 100.000000 [get_ports {data_in[17]}]
set_max_capacitance 80.000000 [get_ports {data_in[17]}]
set_max_transition 100.000000 [get_ports {data_in[17]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[17]}]
set_load -pin_load 4.370000 [get_ports {data_out[59]}]
set_max_transition 100.000000 [get_ports {data_in[1]}]
set_max_capacitance 80.000000 [get_ports {data_in[1]}]
set_max_transition 100.000000 [get_ports {data_in[1]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[1]}]
set_max_transition 100.000000 [get_ports {data_in[51]}]
set_max_capacitance 80.000000 [get_ports {data_in[51]}]
set_max_transition 100.000000 [get_ports {data_in[51]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[51]}]
set_max_transition 100.000000 [get_ports {data_in[34]}]
set_max_capacitance 80.000000 [get_ports {data_in[34]}]
set_max_transition 100.000000 [get_ports {data_in[34]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[34]}]
set_load -pin_load 4.370000 [get_ports {data_out[34]}]
set_max_transition 100.000000 [get_ports {data_in[16]}]
set_max_capacitance 80.000000 [get_ports {data_in[16]}]
set_max_transition 100.000000 [get_ports {data_in[16]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[16]}]
set_load -pin_load 4.370000 [get_ports {data_out[58]}]
set_load -pin_load 4.370000 [get_ports {data_out[33]}]
set_max_transition 100.000000 [get_ports {data_in[14]}]
set_max_capacitance 80.000000 [get_ports {data_in[14]}]
set_max_transition 100.000000 [get_ports {data_in[14]}]
set_driving_cell -lib_cell {PO8W} -library {SP018W_V1p8_max} -from_pin {I} -pin {PAD} [get_ports {data_in[14]}]
